In [103]:
import pandas as pd
import matplotlib.pyplot as plt

In [104]:
# [Po]rto [A]legre [W]eather dataframe being loaded from the csv with ';' as separator
poaw = pd.read_csv('DATA_POA_2001-01-01_2022-03-11.csv',sep=';')
poaw.head()

,Data Medicao,"PRECIPITACAO TOTAL, DIARIO (mm)","TEMPERATURA MAXIMA, DIARIA (C)","TEMPERATURA MEDIA, DIARIA (C)","TEMPERATURA MINIMA, DIARIA (C)","UMIDADE RELATIVA DO AR, MEDIA DIARIA (%)","UMIDADE RELATIVA DO AR, MINIMA DIARIA (%)",Unnamed: 7
0,2001-01-01,0,"30,1","23,616667","18,4","68,458333",48.0,NaN
1,2001-01-02,0,"32,1","25,475",20,"69,958333",45.0,NaN
2,2001-01-03,0,"33,4","26,345833",21,"69,083333",43.0,NaN
3,2001-01-04,0,"35,5","27,429167","21,2","65,041667",37.0,NaN
4,2001-01-05,0,"35,6","27,6375","24,6","67,25",35.0,NaN

In [105]:
# Drop the last and useless column
poaw.drop(labels='Unnamed: 7',axis=1,inplace=True)

In [106]:
# For simplification and translation purposes I will change the columns names
new_col_names = ['Date',
                 'Total Precip',
                 'Max Temp','Average Temp',
                 'Min Temp',
                 'Avg Relative Humidity',
                 'Min Relative Humidity']

poaw.columns = new_col_names

In [107]:
poaw.head()

,Date,Total Precip,Max Temp,Average Temp,Min Temp,Avg Relative Humidity,Min Relative Humidity
0,2001-01-01,0,"30,1","23,616667","18,4","68,458333",48.0
1,2001-01-02,0,"32,1","25,475",20,"69,958333",45.0
2,2001-01-03,0,"33,4","26,345833",21,"69,083333",43.0
3,2001-01-04,0,"35,5","27,429167","21,2","65,041667",37.0
4,2001-01-05,0,"35,6","27,6375","24,6","67,25",35.0

In [109]:
poaw.head()

,Date,Total Precip,Max Temp,Average Temp,Min Temp,Avg Relative Humidity,Min Relative Humidity
0,2001-01-01,0,"30,1","23,616667","18,4","68,458333",48.0
1,2001-01-02,0,"32,1","25,475",20,"69,958333",45.0
2,2001-01-03,0,"33,4","26,345833",21,"69,083333",43.0
3,2001-01-04,0,"35,5","27,429167","21,2","65,041667",37.0
4,2001-01-05,0,"35,6","27,6375","24,6","67,25",35.0

In [111]:
#Convert the "Date" col to datetime type and the other cols to float type (the last col is already float)
poaw['Date'] = pd.to_datetime(poaw['Date'])

#List with all the cols to be changed from str to float
cols_to_float = ['Total Precip', 'Max Temp', 'Average Temp', 'Min Temp', 'Avg Relative Humidity']

poaw[cols_to_float] = poaw[cols_to_float].apply(lambda x: x.str.replace(',','.').astype(float))

#non used trash
#poaw['Max Temp'] = poaw.iloc[:,2:3].apply(lambda x: x.str.replace(',','.').astype(float))
#poaw['Average Temp'] = poaw.iloc[:,3:4].apply(lambda x: x.str.replace(',','.').astype(float))
#poaw['Min Temp'] = poaw.iloc[:,4:5].apply(lambda x: x.str.replace(',','.').astype(float))
#poaw['Avg Relative Humidity'] = poaw.iloc[:,5:6].apply(lambda x: x.str.replace(',','.').astype(float))

In [118]:
poaw

,Date,Total Precip,Max Temp,Average Temp,Min Temp,Avg Relative Humidity,Min Relative Humidity
0,2001-01-01,0.0,30.1,23.616667,18.4,68.458333,48.0
1,2001-01-02,0.0,32.1,25.475000,20.0,69.958333,45.0
2,2001-01-03,0.0,33.4,26.345833,21.0,69.083333,43.0
3,2001-01-04,0.0,35.5,27.429167,21.2,65.041667,37.0
4,2001-01-05,0.0,35.6,27.637500,24.6,67.250000,35.0
...,...,...,...,...,...,...,...
7735,2022-03-07,56.4,35.2,25.170833,21.1,82.416667,51.0
7736,2022-03-08,5.0,28.5,23.954167,20.9,80.416667,61.0
7737,2022-03-09,0.0,30.7,25.216667,21.9,78.958333,66.0
7738,2022-03-10,7.6,29.7,25.454167,22.6,82.083333,60.0
7739,2022-03-11,11.6,NaN,NaN,NaN,NaN,NaN